#include <iostream>

int main() {

    setlocale(LC_ALL, "Russian");

    int N; 
    int X; 

    
    std::cout << "Введите количество бактерий: ";
    std::cin >> N;

    
    while (N < 0) {
        std::cout << "Количество бактерий не может быть отрицательным. Попробуйте снова: ";
        std::cin >> N;
    }

    
    std::cout << "Введите количество антибиотика: ";
    std::cin >> X;

    
    while (X < 0) {
        std::cout << "Количество антибиотика не может быть отрицательным. Попробуйте снова: ";
        std::cin >> X;
    }

    int hour = 0; 
    int bacteria = N; 

    while (bacteria > 0 && X > 0) {
        hour++;

        
        bacteria *= 2;

        
        int killed = std::max(0, 10 - (hour - 1)); 
        if (hour > X) {
            killed = 0; 
        }
        else {
            killed *= X; 
        }

        
        bacteria -= killed;

        
        std::cout << "После " << hour << " часа бактерий осталось " << bacteria << std::endl;
    }

    return 0;
}





//1. Ввод данных : Программа запрашивает у пользователя количество бактерий и количество капель антибиотика.
//2.Контроль ввода : Программа проверяет, что количество бактерий и капель антибиотика не отрицательные.
//3.Цикл обработки : Программа использует цикл while, который продолжается, пока количество бактерий больше нуля и антибиотик еще действует.
//  - Каждую итерацию цикла увеличивается количество бактерий в два раза.
//  - Рассчитывается количество убитых бактерий в зависимости от часа и количества капель антибиотика.
//  - Уменьшается количество бактерий на количество убитых.
//4. Вывод результата : После каждого часа программа выводит количество оставшихся бактерий.