#include <iostream>
#include <limits> 

int main() {
    setlocale(LC_ALL, "Russian");
    int X, Y, P;

    
    std::cout << "Введите размер вклада: ";
    while (!(std::cin >> X) || X <= 0) {
        std::cout << "Ошибка: введите положительное целое число для размера вклада." << std::endl;
        std::cout << "Введите размер вклада: ";
        std::cin.clear(); 
        std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n');
    }

    
    std::cout << "Введите процентную ставку: ";
    while (!(std::cin >> P) || P < 0) {
        std::cout << "Ошибка: введите неотрицательное целое число для процентной ставки." << std::endl;
        std::cout << "Введите процентную ставку: ";
        std::cin.clear(); 
        std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); 
    }

    
    std::cout << "Введите желаемую сумму: ";
    while (!(std::cin >> Y) || Y <= X) {
        std::cout << "Ошибка: желаемая сумма должна быть больше размера вклада." << std::endl;
        std::cout << "Введите желаемую сумму: ";
        std::cin.clear(); 
        std::cin.ignore(std::numeric_limits<std::streamsize>::max(), '\n'); 
    }

    int years = 0;

    
    while (X < Y) {
        X += (X * P) / 100; 
        years++; 
    }

  
    std::cout << "Придётся подождать: " << years << " лет" << std::endl;

    return 0;
}

//1. Программа запрашивает у пользователя размер вклада, процентную ставку и желаемую сумму.
//Для каждого ввода реализован контроль, чтобы гарантировать, что значения корректны(положительные целые числа, желаемая сумма больше размера вклада).
//2. Переменная years инициализируется нулем и будет использоваться для подсчета количества лет, необходимых для достижения желаемой суммы.
//3. В цикле while программа увеличивает вклад на P процентов, используя целочисленное деление для отбрасывания дробной части.
//Цикл продолжается до тех пор, пока вклад меньше желаемой суммы.
//4.После завершения цикла программа выводит количество лет, необходимых для достижения желаемой суммы.