#include <iostream>

int main() {

    setlocale(LC_ALL, "Russian");

    int width, height;

    
    std::cout << "Введите ширину и высоту рамки (например, 6 4): ";
    std::cin >> width >> height;

    
    if (width < 2 || height < 2) {
        std::cout << "Ширина и высота должны быть не менее 2." << std::endl;
        return 1; 
    }

    
    for (int i = 0; i < width; i++) {
        std::cout << "-";
    }
    std::cout << std::endl;

    
    for (int i = 0; i < height - 2; i++) {
        std::cout << "|"; 
        for (int j = 0; j < width - 2; j++) {
            std::cout << " "; 
        }
        std::cout << "|"; 
        std::cout << std::endl;
    }

    
    for (int i = 0; i < width; i++) {
        std::cout << "-";
    }
    std::cout << std::endl;

    return 0;
}



//Программа запрашивает у пользователя ввод ширины и высоты рамки.
//Проверяет, что ширина и высота не меньше 2, чтобы можно было нарисовать рамку(с учетом границ).
//Сначала рисуется верхняя граница рамки с помощью цикла for, который выводит символ « - » столько раз, сколько указано в ширине.
//Затем рисуются боковые границы рамки.Внутри рамки выводятся пробелы, чтобы создать пустое пространство.Для этого используется вложенный цикл : внешний цикл отвечает за высоту, а внутренний — за ширину.
//В конце рисуется нижняя граница рамки аналогично верхней границе.