#include <iostream>

int main() {
    setlocale(LC_ALL, "Russian");


    int N;

    std::cout << "Введите номер последовательности: ";
    while (!(std::cin >> N) || N <= 0) {
        std::cout << "Ошибка: введите положительное целое число." << std::endl;
        std::cout << "Введите номер последовательности: ";
        std::cin.clear();  
    }

    
    if (N > 46) {
        std::cout << "Ошибка: число превышает предел (N должно быть <= 46)." << std::endl;
        return 1; 
    }

    
    unsigned long long a = 1, b = 1, fib = 1;

    
    if (N == 1 || N == 2) {
        fib = 1;
    }
    else {
        for (int i = 3; i <= N; ++i) {
            fib = a + b; 
            a = b; 
            b = fib; 
        }
    }

    std::cout << "Число в последовательности: " << fib << std::endl;

    return 0;
}



//
//1. Программа запрашивает у пользователя ввод номера последовательности Фибоначчи.
//2. Используется цикл while для проверки, что введенное значение является положительным целым числом.
//Если ввод некорректен, программа запрашивает ввод повторно.
//3. Проверяется, что N не превышает 46, так как 47 - е число Фибоначчи(2971215073) превышает 2 147 483 647.
//4. Программа использует переменные a и b для хранения двух последних чисел Фибоначчи и переменную fib для хранения текущего числа.
//5. Если N равно 1 или 2, программа сразу присваивает fib значение 1. В противном случае программа использует цикл for, чтобы вычислить N - е число Фибоначчи.
//6. В конце программа выводит результат.