#include <iostream>

int main() {

    setlocale(LC_ALL, "Russian");

    const int width = 20;  
    const int height = 15; 
    int x = width / 2;   
    int y = height / 2;  

    char command;

    
    while (true) {
        std::cout << "[Программа]: Марсоход находится на позиции " << x << ", " << y << ", введите команду (W/A/S/D для движения, Q для выхода): ";
        std::cin >> command;

        
        if (command == 'W' || command == 'w') {
            if (y < height) {
                y++;
            }
        }
        else if (command == 'S' || command == 's') {
            if (y > 1) {
                y--;
            }
        }
        else if (command == 'A' || command == 'a') {
            if (x > 1) {
                x--;
            }
        }
        else if (command == 'D' || command == 'd') {
            if (x < width) {
                x++;
            }
        }
        else if (command == 'Q' || command == 'q') {
            std::cout << "Выход из программы." << std::endl;
            break;
        }
        else {
            std::cout << "Ошибка: Неверная команда. Пожалуйста, используйте W, A, S, D для движения или Q для выхода." << std::endl;
            continue;
        }

        
        std::cout << "[Программа]: Марсоход находится на позиции " << x << ", " << y << "." << std::endl;
    }

    return 0;
}



//
//Программа задает размеры комнаты(ширина 20 метров и высота 15 метров) и устанавливает начальную позицию марсохода в центре комнаты.
//Используется бесконечный цикл while, который позволяет оператору вводить команды для управления марсоходом.
//Программа запрашивает у пользователя команду и проверяет, какая команда была введена :
//W или w — движение на север(увеличение координаты Y).
//S или s — движение на юг(уменьшение координаты Y).
//A или a — движение на запад(уменьшение координаты X).
//D или d — движение на восток(увеличение координаты X).
//Q или q — выход из программы.
//Программа проверяет, не упирается ли марсоход в стену, и только тогда изменяет его позицию.
//Если введена неверная команда, программа выводит сообщение об ошибке и предлагает ввести команду снова.
//После каждого успешного перемещения программа выводит новую позицию марсохода.