#include <iostream>

int main() {
    int hours;
    setlocale(LC_ALL, "Russian");

    
    std::cout << "Введите, который час: ";
    std::cin >> hours;

    
    while (hours < 0 || hours > 23) {
        std::cout << "Ошибка: введите число от 0 до 23." << std::endl;
        std::cout << "Введите, который час: ";
        std::cin >> hours;
    }

    
    for (int i = 0; i < hours; ++i) {
        std::cout << "Ку-ку!" << std::endl;
    }

    return 0;
}




//
//1. Программа запрашивает у пользователя ввод количества часов.
//2. Используется цикл while для проверки, что введенное значение находится в диапазоне от 0 до 23. Если значение некорректно, 
//программа запрашивает ввод повторно.
//3.Если ввод корректен, программа использует цикл for, чтобы вывести "Ку-ку!" столько раз, сколько указано в переменной hours.
//4.Программа завершает свою работу после вывода всех сообщений.