#include <iostream>
#include <cmath> 
int main() {
    setlocale(LC_ALL, "Russian");

    long long number; 
    std::cout << "Введите число: ";
    std::cin >> number;

    
    if (number < 0) {
        number = std::abs(number); 
    }

    int digitCount = 0;

    
    if (number == 0) {
        digitCount = 1;
    }
    else {
        while (number > 0) {
            number /= 10; 
            digitCount++; 
        }
    }

  
    std::cout << "Цифр в числе: " << digitCount << std::endl;

    return 0;
}





//1.Программа запрашивает у пользователя ввод числа и сохраняет его в переменной типа long long,
//чтобы иметь возможность работать с большими числами.
//2.Если введенное число отрицательное, оно преобразуется в положительное с помощью функции std::abs().
//3.Программа проверяет, равно ли число нулю.Если да, то количество цифр устанавливается в 1.
//4.В противном случае программа использует цикл while, чтобы делить число на 10, пока оно не станет равным нулю, 
//увеличивая счетчик цифр на каждой итерации.
//5.В конце программа выводит количество цифр в числе.